challenge-19/tests/performance/artillery/result_bloq.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 10:46:31(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 10:46:32(-0300)

All VUs finished. Total time: 10 seconds

--------------------------------
Summary report @ 10:46:39(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 165/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 86
  median: ...................................................................... 45.2
  p95: ......................................................................... 66
  p99: ......................................................................... 82.3
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1793.3
  max: ......................................................................... 2419.3
  median: ...................................................................... 2276.1
  p95: ......................................................................... 2416.8
  p99: ......................................................................... 2416.8